# Pandas教程

### 2017七月在线 Python数据分析基础课 julyedu.com
by 褚则伟

## 目录
- Index
- csv文件读写

## Index

### index object

In [1]:
import pandas as pd
import numpy as np

自己建一个index object

In [2]:
index = pd.Index(["Shanghai", "Beijing", "Guangzhou", "Shenzhen"])
index

Index(['Shanghai', 'Beijing', 'Guangzhou', 'Shenzhen'], dtype='object')

In [3]:
"Shanghai" in index

True

从Series里面拿出一个index object

In [6]:
obj = pd.Series(range(3), index=["a", "b", "c"])
obj_index = obj.index

In [8]:
obj_index[1:]

Index(['b', 'c'], dtype='object')

index的值是不能被更改的

In [5]:
index[1] = "Hangzhou"

TypeError: Index does not support mutable operations

创建Series时声明index

In [9]:
index

Index(['Shanghai', 'Beijing', 'Guangzhou', 'Shenzhen'], dtype='object')

In [11]:
apts = pd.Series([60000, 50000, 20000, 55000], index=index, name="apts")
apts

Shanghai     60000
Beijing      50000
Guangzhou    20000
Shenzhen     55000
Name: apts, dtype: int64

sex_index

In [12]:
df = pd.DataFrame({"city": ["Beijing", "Beijing", "Shanghai", "Shanghai"],
                  "year": [2016, 2017, 2016, 2017],
                  "label": [0, 1, 2, 3],
                  "population": [2100, 2200, 2300, 2400]})
df

       city  label  population  year
0   Beijing      0        2100  2016
1   Beijing      1        2200  2017
2  Shanghai      2        2300  2016
3  Shanghai      3        2400  2017

In [14]:
df_label = df.set_index("label")
df_label

           city  population  year
label
0       Beijing        2100  2016
1       Beijing        2200  2017
2      Shanghai        2300  2016
3      Shanghai        2400  2017

In [15]:
df.set_index("label", drop=False)

           city  label  population  year
label
0       Beijing      0        2100  2016
1       Beijing      1        2200  2017
2      Shanghai      2        2300  2016
3      Shanghai      3        2400  2017

In [16]:
df.set_index(["city", "year"])

               label  population
city     year
Beijing  2016      0        2100
         2017      1        2200
Shanghai 2016      2        2300
         2017      3        2400

In [18]:
df_label.set_index(["city", "year"])

               population
city     year
Beijing  2016        2100
         2017        2200
Shanghai 2016        2300
         2017        2400

In [21]:
df3 = df_label.set_index(["city", "year"], append=True)
df3

                     population
label city     year
0     Beijing  2016        2100
1     Beijing  2017        2200
2     Shanghai 2016        2300
3     Shanghai 2017        2400

In [22]:
df3.reset_index()

   label      city  year  population
0      0   Beijing  2016        2100
1      1   Beijing  2017        2200
2      2  Shanghai  2016        2300
3      3  Shanghai  2017        2400

In [24]:
df3.reset_index(level=1)

                city  population
label year
0     2016   Beijing        2100
1     2017   Beijing        2200
2     2016  Shanghai        2300
3     2017  Shanghai        2400

In [25]:
df3.reset_index(level=[1,2])

           city  year  population
label
0       Beijing  2016        2100
1       Beijing  2017        2200
2      Shanghai  2016        2300
3      Shanghai  2017        2400

In [26]:
df3.index

MultiIndex(levels=[[0, 1, 2, 3], ['Beijing', 'Shanghai'], [2016, 2017]],
           labels=[[0, 1, 2, 3], [0, 0, 1, 1], [0, 1, 0, 1]],
           names=['label', 'city', 'year'])

### 针对index进行索引和切片

In [27]:
s = pd.Series(np.arange(4), index=["a", "b", 'c', 'd'])
s

a    0
b    1
c    2
d    3
dtype: int64

In [28]:
s['b']

1

默认的数字index依旧可以使用

In [30]:
s[2]

2

In [31]:
s[[2,1]]

c    2
b    1
dtype: int64

下面是如何对Series进行切片

In [32]:
s['b':'c']

b    1
c    2
dtype: int64

对DataFrame进行Indexing与Series基本相同

In [34]:
df = pd.DataFrame(np.arange(9).reshape(3,3), 
                 index = ['a', 'b', 'c'],
                 columns = ['x', 'y', 'z'])
df.index

Index(['a', 'b', 'c'], dtype='object')

In [35]:
df.columns

Index(['x', 'y', 'z'], dtype='object')

In [40]:
df.T

   a  b  c
x  0  3  6
y  1  4  7
z  2  5  8

In [41]:
df

   x  y  z
a  0  1  2
b  3  4  5
c  6  7  8

In [42]:
df[["x", "z"]]

   x  z
a  0  2
b  3  5
c  6  8

In [47]:
df.loc["a":"b", "x":"y"]

   x  y
a  0  1
b  3  4

DataFrame也可以用condition selection

In [50]:
df[df.x < 5]

   x  y  z
a  0  1  2
b  3  4  5

In [52]:
df[df<5] = 0
df

   x  y  z
a  0  0  0
b  0  0  5
c  6  7  8

### [reindex](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.reindex.html)

把一个Series或者DataFrame按照新的index顺序进行重排

In [53]:
s = pd.Series([4.5, 2.7, 8.9, -0.4], index = ['d', 'b', 'a', 'c'])
s

d    4.5
b    2.7
a    8.9
c   -0.4
dtype: float64

In [55]:
s.reindex(['a', 'b', 'c', 'd', 'e'])

a    8.9
b    2.7
c   -0.4
d    4.5
e    NaN
dtype: float64

In [56]:
s = pd.Series(['blue', 'red', 'yellow'], index=[0,2,4])
s

0      blue
2       red
4    yellow
dtype: object

In [59]:
s.reindex(range(6), method="ffill")

0      blue
1      blue
2       red
3       red
4    yellow
5    yellow
dtype: object

In [60]:
s.reindex(range(6), method="bfill")

0      blue
1       red
2       red
3    yellow
4    yellow
5       NaN
dtype: object

既然我们可以对Series进行reindex，相应地，我们也可以用同样的方法对DataFrame进行reindex。

In [64]:
df = pd.DataFrame(np.arange(9).reshape(3,3), 
                 index = ['b', 'a', 'd'],
                 columns = ['y', 'z', 'x'])
df

   y  z  x
b  0  1  2
a  3  4  5
d  6  7  8

In [63]:
df = df.reindex(['a', 'b', 'c', 'd'])
df

     x    y    z
a  3.0  4.0  5.0
b  0.0  1.0  2.0
c  NaN  NaN  NaN
d  6.0  7.0  8.0

In [66]:
df = df.reindex(['a', 'b', 'c', 'd'], columns = ['x', 'y', 'z'])
df

     x    y    z
a  5.0  3.0  4.0
b  2.0  0.0  1.0
c  NaN  NaN  NaN
d  8.0  6.0  7.0

在reindex的同时，我们还可以重新指定columns

下面介绍如何用drop来删除Series和DataFrame中的index

In [68]:
df2 = df.drop("b")
df2

     x    y    z
a  5.0  3.0  4.0
c  NaN  NaN  NaN
d  8.0  6.0  7.0

In [69]:
df.drop(["a", "c"])

     x    y    z
b  2.0  0.0  1.0
d  8.0  6.0  7.0

In [72]:
df.drop(["y", "x"], axis=1)

     z
a  4.0
b  1.0
c  NaN
d  7.0

drop不仅仅可以删除行，还可以删除列

In [73]:
df

     x    y    z
a  5.0  3.0  4.0
b  2.0  0.0  1.0
c  NaN  NaN  NaN
d  8.0  6.0  7.0

### hierarchical index

Series的hierarchical indexing

In [74]:
data = pd.Series(np.random.randn(10), index = [["a", 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd', 'd'],\
                                               [1,2,3,1,2,1,2,1,2,3]])
data

a  1    0.749063
   2   -1.377602
   3   -0.243244
b  1    0.807103
   2   -0.817357
c  1   -0.177958
   2    1.181911
d  1    0.485940
   2    1.860314
   3    0.545842
dtype: float64

In [75]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3, 3], [0, 1, 2, 0, 1, 0, 1, 0, 1, 2]])

In [78]:
type(data)

pandas.core.series.Series

In [80]:
data["b": "c"]

b  1    0.807103
   2   -0.817357
c  1   -0.177958
   2    1.181911
dtype: float64

In [81]:
data[:2]

a  1    0.749063
   2   -1.377602
dtype: float64

unstack和stack可以帮助我们在hierarchical indexing和DataFrame之间进行切换。

In [86]:
unstacked = data.unstack()
unstacked

          1         2         3
a  0.749063 -1.377602 -0.243244
b  0.807103 -0.817357       NaN
c -0.177958  1.181911       NaN
d  0.485940  1.860314  0.545842

In [83]:
type(data.unstack())

pandas.core.frame.DataFrame

In [87]:
unstacked.stack()

a  1    0.749063
   2   -1.377602
   3   -0.243244
b  1    0.807103
   2   -0.817357
c  1   -0.177958
   2    1.181911
d  1    0.485940
   2    1.860314
   3    0.545842
dtype: float64

In [89]:
df.stack()

a  x    5.0
   y    3.0
   z    4.0
b  x    2.0
   y    0.0
   z    1.0
d  x    8.0
   y    6.0
   z    7.0
dtype: float64

DataFrame的hierarchical indexing

In [91]:
df = pd.DataFrame(np.arange(12).reshape(4,3),
                    index = [["a", "a", 'b', 'b'], [1,2,1,2]],
                    columns = [["x", "y", "y"], [1,1,2]])
df

     x   y
     1   1   2
a 1  0   1   2
  2  3   4   5
b 1  6   7   8
  2  9  10  11

In [92]:
df.index.names = ["key1", "key2"]
df.columns.names = ["column1", "column2"]
df

column1    x   y
column2    1   1   2
key1 key2
a    1     0   1   2
     2     3   4   5
b    1     6   7   8
     2     9  10  11

In [98]:
df.loc['a'].loc[1]["x"][1]

0

## csv文件读写

- [read_csv](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html)
- [to_csv](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.to_csv.html)

In [105]:
goog = pd.read_csv("data/GOOG.csv", index_col=0)
# goog

In [104]:
# goog = goog.set_index("Date")

In [106]:
goog = goog.reindex(pd.to_datetime(goog.index))
goog

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2004-08-19,49.813286,51.835709,47.800831,49.982655,49.982655,44871300
2004-08-20,50.316402,54.336334,50.062355,53.952770,53.952770,22942800
2004-08-23,55.168217,56.528118,54.321388,54.495735,54.495735,18342800
2004-08-24,55.412300,55.591629,51.591621,52.239193,52.239193,15319700
2004-08-25,52.284027,53.798351,51.746044,52.802086,52.802086,9232100
2004-08-26,52.279045,53.773445,52.134586,53.753517,53.753517,7128600
2004-08-27,53.848164,54.107193,52.647663,52.876804,52.876804,6241200
2004-08-30,52.443428,52.548038,50.814533,50.814533,50.814533,5221400
2004-08-31,50.958992,51.661362,50.889256,50.993862,50.993862,4941200
2004-09-01,51.158245,51.292744,49.648903,49.937820,49.937820,9181600
2004-09-02,49.409801,50.993862,49.285267,50.565468,50.565468,15190400
2004-09-03,50.286514,50.680038,49.474556,49.818268,49.818268,5176800
2004-09-07,50.316402,50.809555,49.619015,50.600338,50.600338,5875200
2004-09-08,50.181908,51.322632,50.062355,50.958992,50.958992,5009200
2004-09-09,51.073563,51.163227,50.311420,50.963974,50.963974,4080900
2004-09-10,50.610302,53.081039,50.460861,52.468334,52.468334,8740200
2004-09-13,53.115910,54.002586,53.031227,53.549286,53.549286,7881300
2004-09-14,53.524376,55.790882,53.195610,55.536835,55.536835,10880300
2004-09-15,55.073570,56.901718,54.894241,55.790882,55.790882,10763900
2004-09-16,55.960247,57.683788,55.616535,56.772205,56.772205,9310200
2004-09-17,56.996365,58.525631,56.562988,58.525631,58.525631,9517400
2004-09-20,58.256641,60.572956,58.166977,59.457142,59.457142,10679200
2004-09-21,59.681301,59.985161,58.535595,58.699978,58.699978,7263000
2004-09-22,58.480801,59.611561,58.186901,58.968971,58.968971,7617100
2004-09-23,59.198112,61.086033,58.291508,60.184414,60.184414,8576100
2004-09-24,60.244190,61.818291,59.656395,59.691261,59.691261,9166700
2004-09-27,59.556767,60.214302,58.680054,58.909195,58.909195,7099600
2004-09-28,60.423519,63.462128,59.880554,63.193138,63.193138,17009400
2004-09-29,63.113434,67.257904,62.879314,65.295258,65.295258,30661400
2004-09-30,64.707458,65.902977,64.259140,64.558022,64.558022,13823300
...,...,...,...,...,...,...
2017-06-08,982.349976,984.570007,977.200012,983.409973,983.409973,1481900
2017-06-09,984.500000,984.500000,935.630005,949.830017,949.830017,3309400
2017-06-12,939.559998,949.354980,915.232971,942.900024,942.900024,3763500
2017-06-13,951.909973,959.979980,944.090027,953.400024,953.400024,2013300
2017-06-14,959.919983,961.150024,942.250000,950.760010,950.760010,1489700
2017-06-15,933.969971,943.338989,924.440002,942.309998,942.309998,2133100
2017-06-16,940.000000,942.039978,931.594971,939.780029,939.780029,3094700
2017-06-19,949.960022,959.989990,949.049988,957.369995,957.369995,1533300
2017-06-20,957.520020,961.619995,950.010010,950.630005,950.630005,1126000
2017-06-21,953.640015,960.099976,950.760010,959.450012,959.450012,1202200
2017-06-22,958.700012,960.719971,954.549988,957.090027,957.090027,941400
2017-06-23,956.830017,966.000000,954.200012,965.590027,965.590027,1527900
2017-06-26,969.900024,973.309998,950.789978,952.270020,952.270020,1598400
2017-06-27,942.460022,948.289978,926.849976,927.330017,927.330017,2579900
2017-06-28,929.000000,942.750000,916.000000,940.489990,940.489990,2721400
2017-06-29,929.919983,931.260010,910.619995,917.789978,917.789978,3299200
2017-06-30,926.049988,926.049988,908.309998,908.729980,908.729980,2065500
2017-07-03,912.179993,913.940002,894.789978,898.700012,898.700012,1709800
2017-07-05,901.760010,914.510010,898.500000,911.710022,911.710022,1813900
2017-07-06,904.119995,914.943970,899.700012,906.690002,906.690002,1424500
2017-07-07,908.849976,921.539978,908.849976,918.590027,918.590027,1637800
2017-07-10,921.770020,930.380005,919.590027,928.799988,928.799988,1192800
2017-07-11,929.539978,931.429993,922.000000,930.090027,930.090027,1113200
2017-07-12,938.679993,946.299988,934.469971,943.830017,943.830017,1532100
2017-07-13,946.289978,954.450012,943.010010,947.159973,947.159973,1294700
2017-07-14,952.000000,956.909973,948.005005,955.989990,955.989990,1053800
2017-07-17,957.000000,960.739990,949.241028,953.419983,953.419983,1165500
2017-07-18,953.000000,968.039978,950.599976,965.400024,965.400024,1154000
2017-07-19,967.840027,973.039978,964.030029,970.890015,970.890015,1224500
2017-07-20,975.000000,975.900024,961.510010,968.150024,968.150024,1616500

In [107]:
goog.head()

                 Open       High        Low      Close  Adj Close    Volume
Date
2004-08-19  49.813286  51.835709  47.800831  49.982655  49.982655  44871300
2004-08-20  50.316402  54.336334  50.062355  53.952770  53.952770  22942800
2004-08-23  55.168217  56.528118  54.321388  54.495735  54.495735  18342800
2004-08-24  55.412300  55.591629  51.591621  52.239193  52.239193  15319700
2004-08-25  52.284027  53.798351  51.746044  52.802086  52.802086   9232100

In [108]:
goog.tail()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2017-07-14,952.000000,956.909973,948.005005,955.989990,955.989990,1053800
2017-07-17,957.000000,960.739990,949.241028,953.419983,953.419983,1165500
2017-07-18,953.000000,968.039978,950.599976,965.400024,965.400024,1154000
2017-07-19,967.840027,973.039978,964.030029,970.890015,970.890015,1224500
2017-07-20,975.000000,975.900024,961.510010,968.150024,968.150024,1616500

In [111]:
df.to_csv("data/sample.tsv", sep="\t")

## exercise
download stock data from yahoo finance, and use read_csv to create dataframe, and play with the dataframe.